Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes.Location Property
 The location of the mark tag.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TagLocation Location { get; set; }
Public Property Location As TagLocation
	Get
	Set
Property Value
Type: TagLocation
See Also
Reference
ViewMarkBasicTagAttributes Class
Tekla.Structures.Drawing Namespace